In [1]:
people = {
    "first": ["Corey", 'Jane', 'John', 'Adam'],
    "last": ["Schafer", 'Doe', 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}

In [2]:
people['email']

['CoreyMSchafer@gmail.com',
 'JaneDoe@email.com',
 'JohnDoe@email.com',
 'A@email.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [6]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
3                A@email.com
Name: email, dtype: object

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
3                A@email.com
Name: email, dtype: object

In [9]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com
3      Doe              A@email.com

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [12]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [13]:
df.set_index('email')

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe
A@email.com               Adam      Doe

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [15]:
 df.set_index('email', inplace=True)

In [16]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe
A@email.com               Adam      Doe

In [17]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com',
       'A@email.com'],
      dtype='object', name='email')

In [18]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [19]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [20]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3              A@email.com   Adam      Doe

In [21]:
df['last'] == 'Doe'

0    False
1     True
2     True
3     True
Name: last, dtype: bool

In [22]:
filt = (df['last'] == 'Doe')

In [23]:
df[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe
3        A@email.com  Adam  Doe

In [24]:
df[df['last'] == 'Doe']

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe
3        A@email.com  Adam  Doe

In [25]:
df.loc[filt, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
3          A@email.com
Name: email, dtype: object

In [26]:
filt2 = (df['last'] == 'Doe') & (df['first'] == 'John')

In [27]:
df[filt2]

               email first last
2  JohnDoe@email.com  John  Doe

In [28]:
df.loc[filt2, 'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [29]:
filt3 = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [30]:
df.loc[filt3, 'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [31]:
df.loc[~filt3, 'email']

1    JaneDoe@email.com
3          A@email.com
Name: email, dtype: object

In [32]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [33]:
df.columns = ['email', 'first_name', 'last_name']
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3              A@email.com       Adam       Doe

In [34]:
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3              A@email.com       Adam       Doe

In [35]:
df.columns = df.columns.str.replace('_', ' ')
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3              A@email.com       Adam       Doe

In [36]:
df.rename(columns={'FIRST NAME' : 'first', 'LAST NAME' : 'last' })

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3              A@email.com   Adam      Doe

In [37]:
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe
3              A@email.com       Adam       Doe

In [38]:
df.rename(columns={'FIRST NAME' : 'first', 'LAST NAME' : 'last' }, inplace=True)

In [39]:
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3              A@email.com   Adam      Doe

In [40]:
df.loc[2] = ['JohnSmith@email.com', 'John', 'Smith']
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2      JohnSmith@email.com   John    Smith
3              A@email.com   Adam      Doe

In [41]:
df.loc[2, ['last', 'EMAIL']] = ['Doe', 'JohnDoe@email.com']
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3              A@email.com   Adam      Doe

In [42]:
df.loc[2, 'last'] = 'Smith'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John    Smith
3              A@email.com   Adam      Doe

In [43]:
df.at[2, 'last'] = 'Doe'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe
3              A@email.com   Adam      Doe

In [44]:
filt6 = (df['EMAIL'] == 'JohnDoe@email.com')
df[filt6]['last'] = 'Smith'

C:\Users\janek\AppData\Local\Temp\ipykernel_12436\3264677793.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt6]['last'] = 'Smith'

In [45]:
filt6 = (df['EMAIL'] == 'JohnDoe@email.com')
df.loc[filt6, 'last'] = 'Smith'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John    Smith
3              A@email.com   Adam      Doe

In [46]:
df['EMAIL'] = df['EMAIL'].str.lower()
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@email.com   Jane      Doe
2        johndoe@email.com   John    Smith
3              a@email.com   Adam      Doe

In [47]:
df['EMAIL'].apply(len)

0    23
1    17
2    17
3    11
Name: EMAIL, dtype: int64

In [48]:
def update_email(email):
    return email.upper()

In [49]:
df['EMAIL'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
3                A@EMAIL.COM
Name: EMAIL, dtype: object

In [50]:
df['EMAIL'] = df['EMAIL'].apply(lambda x: x.lower())
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@email.com   Jane      Doe
2        johndoe@email.com   John    Smith
3              a@email.com   Adam      Doe

In [51]:
df['EMAIL'].apply(len)

0    23
1    17
2    17
3    11
Name: EMAIL, dtype: int64

In [52]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [53]:
len(df['EMAIL'])

4

In [54]:
df.apply(pd.Series.min)

EMAIL    a@email.com
first           Adam
last             Doe
dtype: object

In [55]:
df.apply(lambda x: x.min())

EMAIL    a@email.com
first           Adam
last             Doe
dtype: object

In [56]:
 df.applymap(len)

   EMAIL  first  last
0     23      5     7
1     17      4     3
2     17      4     5
3     11      4     3

In [57]:
df.applymap(str.lower)

                     EMAIL  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@email.com   jane      doe
2        johndoe@email.com   john    smith
3              a@email.com   adam      doe

In [58]:
df['first'].map({'Corey' : 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
3      NaN
Name: first, dtype: object

In [59]:
df['first'].replace({'Corey' : 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
3     Adam
Name: first, dtype: object

In [60]:
df['first'] = df['first'].replace({'Corey' : 'Chris', 'Jane': 'Mary'})

In [61]:
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Chris  Schafer
1        janedoe@email.com   Mary      Doe
2        johndoe@email.com   John    Smith
3              a@email.com   Adam      Doe

In [62]:
df['first'] + ' '+ df['last']

0    Chris Schafer
1         Mary Doe
2       John Smith
3         Adam Doe
dtype: object

In [63]:
df['full_name'] = df['first'] + ' ' + df['last']
df

                     EMAIL  first     last      full_name
0  coreymschafer@gmail.com  Chris  Schafer  Chris Schafer
1        janedoe@email.com   Mary      Doe       Mary Doe
2        johndoe@email.com   John    Smith     John Smith
3              a@email.com   Adam      Doe       Adam Doe

In [64]:
df.drop(columns=['first', 'last'], inplace=True)
df

                     EMAIL      full_name
0  coreymschafer@gmail.com  Chris Schafer
1        janedoe@email.com       Mary Doe
2        johndoe@email.com     John Smith
3              a@email.com       Adam Doe

In [65]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Chris  Schafer
1   Mary      Doe
2   John    Smith
3   Adam      Doe

In [66]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe

In [67]:
df.append({'first': 'Tony'}, ignore_index=True)

C:\Users\janek\AppData\Local\Temp\ipykernel_12436\3387188866.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4                      NaN            NaN   Tony      NaN

In [68]:
people = {
    "first": ['Tony', 'Steve'],
    "last": ['Stark', 'Rogers'],
    "EMAIL": ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [69]:
df2

   first    last               EMAIL
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [70]:
df.append(df2, ignore_index=True, sort=False)

C:\Users\janek\AppData\Local\Temp\ipykernel_12436\2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [71]:
df = df.append(df2, ignore_index=True, sort=False)
df

C:\Users\janek\AppData\Local\Temp\ipykernel_12436\2085770871.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [72]:
df.drop(index=4)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
5           Cap@avenge.com            NaN  Steve   Rogers

In [73]:
df.drop(index=df[df['last'] == 'Doe'].index)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
2        johndoe@email.com     John Smith   John    Smith
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [74]:
df

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [75]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
2        johndoe@email.com     John Smith   John    Smith
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [76]:
df.sort_values(by='last')

                     EMAIL      full_name  first     last
1        janedoe@email.com       Mary Doe   Mary      Doe
3              a@email.com       Adam Doe   Adam      Doe
5           Cap@avenge.com            NaN  Steve   Rogers
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
2        johndoe@email.com     John Smith   John    Smith
4       IronMan@avenge.com            NaN   Tony    Stark

In [77]:
df.sort_values(by='last', ascending=False)

                     EMAIL      full_name  first     last
4       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
5           Cap@avenge.com            NaN  Steve   Rogers
1        janedoe@email.com       Mary Doe   Mary      Doe
3              a@email.com       Adam Doe   Adam      Doe

In [78]:
df.sort_values(by=['last', 'first'], ascending=False)

                     EMAIL      full_name  first     last
4       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
5           Cap@avenge.com            NaN  Steve   Rogers
1        janedoe@email.com       Mary Doe   Mary      Doe
3              a@email.com       Adam Doe   Adam      Doe

In [80]:
df.sort_values(by=['last', 'first'], ascending=[False, True])

                     EMAIL      full_name  first     last
4       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
5           Cap@avenge.com            NaN  Steve   Rogers
3              a@email.com       Adam Doe   Adam      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [81]:
df

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [82]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)
df

                     EMAIL      full_name  first     last
4       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
5           Cap@avenge.com            NaN  Steve   Rogers
3              a@email.com       Adam Doe   Adam      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [83]:
df.sort_index()

                     EMAIL      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3              a@email.com       Adam Doe   Adam      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [85]:
df['last'].sort_values()

3        Doe
1        Doe
5     Rogers
0    Schafer
2      Smith
4      Stark
Name: last, dtype: object